from dataclasses import dataclass
from typing import Final


@dataclass(frozen=True, slots=True)
class ExecTarget:
    name: str
    ntst_bsc_id: str
    ntst_plcn_bk_id: str


EXEC_TARGETS: Final[tuple[ExecTarget, ...]] = (
    ExecTarget("국세기본법 집행기준", "100000000000001586", "511100000000000001"),
    ExecTarget("국세징수법 집행기준", "100000000000001585", "511100000000000002"),
    ExecTarget("법인세 집행기준", "100000000000001563", "511100000000000003"),
    ExecTarget("국제조세 집행기준", "100000000000000603", "511100000000000004"),
    ExecTarget("종합소득세 집행기준", "100000000000001565", "511100000000000005"),
    ExecTarget("양도소득세 집행기준", "200000000000001565", "511100000000000006"),
    ExecTarget("종합부동산세 집행기준", "100000000000009873", "511100000000000007"),
    ExecTarget("상속증여세 집행기준", "100000000000001561", "511100000000000008"),
    ExecTarget("개별소비세 집행기준", "100000000000001570", "511100000000000009"),
    ExecTarget("인지세 집행기준", "100000000000001568", "511100000000000009"),
    ExecTarget("주세 집행기준", "100000000000001566", "511100000000000009"),
    ExecTarget("주류면허법 집행기준", "100000000000013931", "511100000000000009"),
    ExecTarget("증권거래세 집행기준", "100000000000000621", "511100000000000010"),
    ExecTarget("부가가치세 집행기준", "100000000000001571", "510000000000000448"),
    ExecTarget("조세특례제한법 집행기준", "100000000000001584", "510000000000000823"),
)
